{
  "sentences": [
    {
      "text": "A Internet das coisas (IoT) descreve a rede de objetos físicos - \"coisas\" - que são incorporados a sensores, software e outras tecnologias com a finalidade de conectar e trocar dados com outros dispositivos e sistemas pela Internet. A definição de A Internet das coisas evoluiu devido à convergência de várias tecnologias, análises em tempo real, aprendizado de máquina, sensores de commodities e sistemas embarcados.",
      "keywords": [
        "Internet of things",
        "Internet.The definition of the Internet of things",
        "machine learning",
        "purpose of connecting",
        "network of physical objects",
        "convergence of multiple technologies",
        "technologies",
        "real-time analytics",
        "things",
        "devices",
        "sensors",
        "data",
        "software",
        "IoT",
        "commodity sensors",
        "systems"
      ],
      "images": []
    },
    {
      "text": "Os campos tradicionais de sistemas embarcados, redes de sensores sem fio, sistemas de controle, automação (incluindo automação residencial e predial) e outros contribuem para habilitar a Internet das coisas.",
      "keywords": [
        "Traditional fields",
        "wireless sensor networks",
        "control systems",
        "Internet of things",
        "automation",
        "others",
        "building automation",
        "systems"
      ],
      "images": []
    },
    {
      "text": "No mercado de consumo, a tecnologia IoT é mais sinônimo de produtos pertencentes ao conceito de \"casa inteligente\", incluindo dispositivos e eletrodomésticos (como luminárias, termostatos, sistemas e câmeras de segurança doméstica e outros eletrodomésticos) que suportam um ou ecossistemas mais comuns e podem ser controlados por meio de dispositivos associados a esse ecossistema, como smartphones e alto-falantes inteligentes.",
      "keywords": [
        "consumer market",
        "smart home",
        "lighting fixtures",
        "home appliances",
        "home security systems",
        "common ecosystems",
        "IoT technology",
        "appliances",
        "devices",
        "cameras",
        "products",
        "support",
        "concept",
        "ecosystem",
        "smartphones",
        "smart speakers",
        "thermostats"
      ],
      "images": []
    },
    {
      "text": "Existem várias preocupações sérias sobre os perigos no crescimento da IoT, especialmente nas áreas de privacidade e segurança e, consequentemente, as iniciativas da indústria e do governo para lidar com essas questões começaram, incluindo o desenvolvimento de padrões internacionais.",
      "keywords": [
        "number of serious concerns",
        "growth of IoT",
        "areas of privacy",
        "governmental moves",
        "dangers",
        "security",
        "industry",
        "concerns",
        "development of international standards"
      ],
      "images": []
    },
    {
      "text": "O conceito principal de uma rede de dispositivos inteligentes foi discutido já em 1982, com uma máquina de venda automática Coca-Cola modificada na Carnegie Mellon University tornando-se o primeiro aparelho conectado à Internet, capaz de relatar seu estoque e se as bebidas recém carregadas estavam geladas ou não .",
      "keywords": [
        "main concept of a network of smart devices",
        "Carnegie Mellon University",
        "modified Coca-Cola",
        "machine",
        "appliance",
        "inventory",
        "drinks",
        "first Internet"
      ],
      "images": []
    },
    {
      "text": "O artigo de Mark Weiser de 1991 sobre computação ubíqua, \"The Computer of the 21st Century\", bem como locais acadêmicos como UbiComp e PerCom produziram a visão contemporânea da IoT.",
      "keywords": [
        "Mark Weiser",
        "ubiquitous computing",
        "Computer of the 21st Century",
        "paper",
        "academic venues",
        "contemporary vision of the IoT",
        "UbiComp",
        "PerCom"
      ],
      "images": []
    },
    {
      "text": "Em 1994, Reza Raji descreveu o conceito no IEEE Spectrum como \"[mover] pequenos pacotes de dados para um grande conjunto de nós, de modo a integrar e automatizar tudo, de eletrodomésticos a fábricas inteiras\".",
      "keywords": [
        "Reza Raji",
        "home appliances",
        "small packets of data",
        "IEEE Spectrum",
        "concept",
        "large set of nodes",
        "entire factories"
      ],
      "images": []
    },
    {
      "text": "Entre 1993 e 1997, várias empresas propuseram soluções como Microsoft's at Work ou Novell's NEST.",
      "keywords": [
        "Novell's NEST",
        "companies",
        "solutions",
        "Microsoft",
        "Work"
      ],
      "images": []
    },
    {
      "text": "O campo ganhou impulso quando Bill Joy visualizou a comunicação dispositivo a dispositivo como parte de sua estrutura \"Six Webs\", apresentada no Fórum Econômico Mundial em Davos em 1999. O termo \"Internet das coisas\" foi cunhado por Kevin Ashton da Procter & Gamble, mais tarde Auto-ID Center do MIT, em 1999, embora ele prefira a frase \"Internet para coisas\".",
      "keywords": [
        "World Economic Forum",
        "Internet of things",
        "Bill Joy",
        "Kevin Ashton of Procter",
        "device communication",
        "MIT's Auto-ID Center",
        "field",
        "1999.The term",
        "device",
        "momentum",
        "part",
        "Webs",
        "framework",
        "Gamble",
        "Davos",
        "Internet",
        "things",
        "phrase"
      ],
      "images": []
    },
    {
      "text": "Nesse ponto, ele via a identificação por radiofrequência (RFID) como essencial para a Internet das coisas, que permitiria aos computadores gerenciar todas as coisas individuais. Definir a Internet das coisas como \"simplesmente o momento em que mais 'coisas ou objetos' estavam conectados à Internet do que as pessoas \", a Cisco Systems estimou que a IoT\" nasceu \"entre 2008 e 2009, com a proporção coisas / pessoas crescendo de 0,08 em 2003 para 1,84 em 2010. A principal força motriz por trás da Internet das coisas é o MOSFET (transistor de efeito de campo semicondutor de óxido metálico ou transistor MOS), que foi originalmente inventado por Mohamed M. Atalla e Dawon Kahng no Bell Labs em 1959.",
      "keywords": [
        "Internet of things",
        "radio-frequency identification",
        "Cisco Systems",
        "point",
        "2010.The key",
        "people ratio",
        "people",
        "things",
        "Internet",
        "computers",
        "Bell Labs",
        "RFID",
        "objects",
        "IoT",
        "force",
        "MOSFET",
        "MOS transistor",
        "Mohamed M. Atalla",
        "individual",
        "metal-oxide-semiconductor field-effect transistor",
        "time",
        "Dawon"
      ],
      "images": []
    }
  ],
  "input": {
    "temaCentral": "Iot",
    "autor": "Fgdfg",
    "instituição": "Fgdfg",
    "dataApresentacao": "22 de Fevereiro de 2000",
    "tamanhoSlide": 10
  }
}