[
  {
    "text": "Counter-Strike: Global Offensive (CS:GO) is a multiplayer first-person shooter video game developed by Valve and Hidden Path Entertainment. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "It is the fourth game in the Counter-Strike series and was released for Windows, OS X, Xbox 360, and PlayStation 3 in August 2012, while the Linux version was released in 2014. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The game pits two teams against each other: the Terrorists and the Counter-Terrorists. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Both sides are tasked with eliminating the other while also completing separate objectives. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The Terrorists, depending on the game mode, must either plant the bomb or defend the hostages, while the Counter-Terrorists must either prevent the bomb from being planted, defuse the bomb, or rescue the hostages. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "There are nine game modes, all of which have distinct characteristics specific to that mode. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The game also has matchmaking support that allows players to play on dedicated Valve servers, as well as allowing members of the community to host their own servers with custom maps and game modes. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "A battle-royale game-mode, \"Danger Zone\", was introduced in 2018. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Global Offensive received positive reviews from critics on release, who praised for its gameplay and faithfulness to predecessors, though it was criticized for some of its early features and was noted for differences between the console and PC versions. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Since its release, it has drawn in an estimated 11 million players per month, and has gathered an active competitive scene, with many tournaments sponsored by Valve themselves. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In December 2018, Valve transitioned the game to a free-to-play model, focusing on revenue from cosmetic items. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Global Offensive, like prior games in the Counter-Strike series, is an objective-based, multiplayer first-person shooter. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Two opposing teams, known as the Terrorists and the Counter-Terrorists, compete in game modes to complete objectives, such as securing a location to plant or defuse a bomb and rescuing or guarding hostages. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "At the end of each round, players are rewarded based on their individual performance with in-game currency to spend on other weapons or utility in subsequent rounds. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Winning rounds rewards more money than losing does, and completing objectives such as killing enemies gives cash bonuses. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Uncooperative actions, such as killing teammates, result in a penalty. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "There are five categories of purchasable weapons, four being guns and the final being utilities: rifles, sub-machine guns (SMGs), heavy, pistols, and grenades. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "All guns have different properties and all grenade types have different in-game effects. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The hand grenade (HE) deals damage in a small radius, the smoke grenade temporarily places a smoke screen, the decoy grenade emulates the player's primary gun, the flashbang temporarily blinds players who look towards it when it explodes, and the Molotov cocktail and Incendiary Grenade set a small part of the map on fire for a short period of time. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Alongside all of the main weapons, the Zeus x27, a taser, can also be purchased.Global Offensive has nine main game modes: Competitive, Casual, Deathmatch, Arms Race, Demolition, Wingman, Flying Scoutsman, Danger Zone, and Weapons Course. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Competitive mode pits players against each other in two teams of five players in roughly 45-minute matches. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The Casual and Deathmatch modes are less serious than Competitive mode and do not register friendly fire or collision with other teammates. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Both are primarily used as a practice tool. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Arms Race is similar to the \"Gun Game\" mod for other games in the series. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "It consists of players racing to upgrade their guns via killing enemies. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Demolition is also like the \"Gun Game\" mod, though players are also able to plant and defuse the bomb. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Players only receive gun upgrades at the start of new rounds if they killed an enemy the previous round. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Wingman is a two-on-two bomb defusal game-mode taking place over fifteen rounds. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "It is similar to Competitive in the sense that players are paired based on their skill levels. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Flying Scoutsman is a mode in which players are equipped only with a SSG 08 and a knife while they play in low-gravity. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The Flying Scoutsman, Demolition, and Arms Race game modes are placed in the War Games tab. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Danger Zone is a battle-royale mode in which players play against up to 16 or 18 others. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Everyone starts with a knife and a tablet and have to search for weapons, ammunition, equipment, and money. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Through the tablet, players can purchase certain weapons, ammunition, and equipment with money found around the map inside buildings and in completing objectives such as returning hostages to the rescue zones. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "When a player purchases an item, it is delivered to them from a drone that goes to their location and drops the item. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The tablet is also used for tracking other players. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The last person or team alive wins, like other battle-royale games. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The Weapons Course is an offline practice mode designed to help new players learn how to use guns and grenades, as well as defusing and planting the bomb. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Apart from the Weapons Course, all seven other game modes can be played online or offline with bots.Matchmaking is supported for all online game modes and is managed through the Steam software. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "These matches run Valve Anti-Cheat to prevent cheating. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In Competitive mode, players are encouraged to act more cautiously in Global Offensive than in most other multiplayer games due to the inability to respawn once killed. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "When playing Competitive, each player has a specific rank based on their skill level and is paired up with other players around the same ranking. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "One form of matchmaking in Global Offensive to prevent cheating, Prime Matchmaking, hosts matches that can only be played with other users with the \"Prime\" feature. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "This feature also results in more equal matches as there are fewer \"smurfs\" in these matches. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The PC version of Global Offensive also supports private dedicated servers that players may connect to through the community server menu in-game. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "These servers may be heavily modified and can drastically differ from the base game modes. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "There have been many community made mods for the game, one of the popular ones being \"kz\", a mod that makes players complete obstacle courses requiring advanced strafing and jumping techniques.Over time, the community developed strategies for competitive play. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "When trying to capture a site, a common strategy used is called \"rushing\". ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Rushing is when a player or group of players move into a choke-point on the map as fast as possible. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "This strategy is used commonly when one of the teams is running an \"eco\". ",
    "keywords": [],
    "images": []
  },
  {
    "text": "An eco is used usually when a team has a lack of money to buy weapons, utility, or armor, forcing the team to be left with less effective weapons and little utility. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "\"Eco rounds\" are rounds in which a team will buy few or no guns in order to save up money for future rounds. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Occasionally, when it is known a team is low on money, the opposition will purchase \"anti-eco\" weapons which perform well at close range. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "This is to prevent casualties and financial bonuses for the opponents. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Rushing is also used if there is a lack of time on the clock and the bomb needs to be planted or defused in an act of desperation. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Another common strategy for taking a site is using predetermined smoke grenades and flashbangs to hinder enemies' sight.Global Offensive saw the introduction of new weapons and equipment not seen in previous installments, most notably the firebomb for each team (referred to as a Molotov on the Terrorist side and as an Incendiary Grenade on the Counter-Terrorist side). ",
    "keywords": [],
    "images": []
  },
  {
    "text": "These temporarily cover a small area in fire, dealing damage to anyone passing through. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Global Offensive also saw the introduction of a range of new weapons, including shotguns, pistols, sub-machine guns, and a taser. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Two new game modes, Arms Race and Demolition, both based on mods for previous iterations in the series, were added alongside a total of eight new maps for said game modes. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Global Offensive saw the removal of features seen in previous iterations of the series. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The ability to freely explore the map when dead was removed from many modes, though server hosts are able to change this setting. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Upon the game's release, the USP and the MP5 were replaced by other guns; however, silenced versions of both guns have since been added. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The tactical shield was removed, but was re-added to the game on May 7, 2019 'Danger Zone' update as the 'Ballistic Shield'.  ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The concept of sprays were not present in the game until the addition of consumable items called graffiti. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Counter-Strike: Global Offensive is the sequel to the popular first-person shooter Counter-Strike: Source, developed by Valve. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Global Offensive's development began when Hidden Path Entertainment attempted to port Counter-Strike: Source onto video game consoles prior to the end of its lifespan. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "During its development, Valve saw the opportunity to turn the port into a full game and expand on the predecessor's gameplay. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Global Offensive began development in March 2010, and was revealed to the public on August 12, 2011. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The closed beta started on November 30, 2011, and was initially restricted to around ten thousand people who received a key at events intended to showcase Global Offensive. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "After issues with client and server stability were addressed, the beta was opened up to progressively more people, and at E3 2012, Valve announced that Global Offensive would be released on August 21, 2012, with the open beta starting roughly a month before that. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Before the public beta, Valve invited professional Counter-Strike players to play-test the game and give feedback.There were plans for cross-platform multiplayer between Windows, OS X, Linux, Xbox 360, and PlayStation 3 players, but was ultimately limited to include only the PC versions because of the difference in update frequency between the systems. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "On August 21, 2012, the game was publicly released on all platforms except Linux, which would not be released until September 23.Since the initial release of Global Offensive, Valve has continued to update the game by introducing new maps and weapons, game-modes, and weapon balancing changes. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "One of the major additions to the game post-release was the \"Arms Deal\" update. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Released on August 13, 2013, it added cosmetic weapon finishes, dubbed as skins, to the game. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "These items are obtainable by unboxing cases using in-game keys, of which are only accessible through in-game microtransactions. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Skins can also be obtained in similar ways to the items in Team Fortress 2 and Dota 2 in the sense that they are dropped randomly. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "During tournaments, viewers have a chance of being rewarded a case that they can open and receive certain skins from. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Global Offensive has Steam Workshop support, allowing users to upload user-created content, such as maps, weapon skins, and custom game-modes. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Some popular user-created skins are added to the game and are obtainable from unboxing them in cases. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The creators of the skins are paid when their item is added to a case. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "These skins helped form a virtual economy for Global Offensive, leading to the creation of gambling, betting, and trading sites.Events called \"Operations\" are held occasionally and can be accessed through purchasable expansion packs in the form of \"operation passes.\" ",
    "keywords": [],
    "images": []
  },
  {
    "text": "These passes grant access to operation objectives which are spread over different game modes, such as Arms Race and Deathmatch, or in operation-specific game modes, first seen in Operation Hydra, released in May 2017. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Completing these challenges rewards the player with XP and the ability to upgrade the operation \"coin.\" ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The maps in the operations are community made, meaning some of the revenue made goes towards the map designers.An update in October 2014 added \"music kits\", which replace the default in-game music with music from soundtrack artists commissioned by Valve. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "If a player with a music kit equipped becomes the round's most valuable player, their music will play for others at the end of the round. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "There is a feature that allows kits to be borrowed, and kits can be sold and exchanged through the Community Market.In 2016, the game saw two remakes of original Counter-Strike maps, as well as the introduction of Prime matchmaking and additional items. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "As a part of the Operation Wildfire promotion, Nuke was remade and re-released in February with the primary goals being to balance the map and make it more aesthetically pleasing. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In April, Prime matchmaking was added to the game. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "To partake in this mode, the user had to have a verified phone number connected to their account. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "It was introduced in an attempt to prevent legitimate players from playing with cheaters or high-skilled players playing on alternative, lower ranked accounts, a practice colloquially known as \"smurfing\". ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Inferno, another original map, was re-released in October. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Valve said they had three reasons behind the remake: \"to improve visibility; to make it easier to move around in groups; and to tune it with player feedback.\" ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Also in October, consumable items called graffiti were added to the game. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "These items replaced a feature present in the previous iterations of the series called sprays. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Previously, players could customize their sprays. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Graffiti ideas can be uploaded to the Steam Workshop in the similar manner as gun skins and players can buy and trade the existing graffiti in game. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "One month later, glove skins were added.In September 2017, Valve Company worked with the publisher Perfect World to release Global Offensive in mainland China. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Chinese citizens, with their identification verified, can receive the game for free and earn Prime matchmaking status immediately. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The game is played through Perfect World's launcher and contains numerous exclusive changes to the game, including the censorship of skulls and other symbols. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Some other changes were in the cosmetics in certain maps, for example, the hammer and sickle on Cache and Train were removed. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In preparation for the release, multiple cities in China celebrated and heavily promoted its upcoming release. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Users who played the game during its launch month received free promotional cosmetics. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In compliance with Chinese law, Valve also had to disclose its loot box gambling odds.In November 2017, an update to the competitive matchmaking was announced. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Called the \"Trust Factor\", it meant a player's \"Trust Factor\" would be calculated through both in-game and Steam-wide actions. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Factors such as playtime on Global Offensive, times a user has been reported for cheating, playtime on other Steam games, and other behaviors hidden by Valve are taken into consideration when a user's \"Trust Factor\" is developed. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "This was done in an attempt to let the community bond back together in matchmaking, as Prime matchmaking separated Prime and non-Prime players from each other. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Valve will not let users view their \"Trust Factor\" or reveal all of the factors deciding one's \"Trust\". ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In August 2018, an offline version of the game was released that allows the players to play offline with bots.An update released on December 6, 2018, made the game fully free to play from that point onward. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Users that had purchased the game prior to this point received a special \"Prime\" status that gives them access to improved matchmaking and modes that can drop cosmetic items while new users have the option to purchase this status. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In addition, the new version introduced a battle royale mode called \"Danger Zone\".",
    "keywords": [],
    "images": []
  },
  {
    "text": "In November 2019, Operation Shattered Web was released. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "It operates similarly to the previous operations and introduces new character models and a battle pass system.In April 2020, source code for 2018 versions of Counter-Strike: Global Offensive and Team Fortress 2 were leaked on the Internet. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "This created fears that malicious users would take advantage of the code to develop potential remote code execution software and attack game servers or players' own computers. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Several ongoing fan projects temporarily halted development in wake of this news until better confirmation of the impact of the leak could be determined. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Valve confirmed the legitimacy of the code leaks, but stated they do not believe it impacts servers and clients running the latest official builds of either game. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Since the game's release, Global Offensive influenced accessories have been released. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "An official store is available which sells collectible products, including a real-life version of the \"Five Year Veteran Coin\". ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Companies such as SteelSeries have partnered with Valve to promote real life peripherals, including headsets, mice and mouse pads. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Following the introduction of the Arms Deal update in August 2013, skins formed a virtual economy due to their rarity and other high-value factors that influenced their desirability. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Due to this, the creation of a number of skin trading sites enabled by the Steamworks API were created. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Some of these sites began to offer gambling functionality, allowing users to bet on the outcome of professional matches with skins. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In June and July 2016, two formal lawsuits were filed against these gambling sites and Valve, stating that these encourage underage gambling and undisclosed promotion by some streamers. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Valve in turn began to take steps to prevent these sites from using Steamworks for gambling purposes, and several of these sites ceased operating as a result. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In July 2018, Valve disabled the opening of containers in Belgium and the Netherlands after their loot boxes appeared to violate Dutch and Belgium gambling laws. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The Global Offensive professional scene consists of tournaments hosted by third-party organisations and Valve-organised or co-sponsored tournaments, referred to as Majors. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Majors have larger prize pools; originally set at $250,000, the prize pools for majors have risen, with MLG Columbus 2016 having the first pool of $1,000,000.In 2014, the \"first large match fixing scandal\" in the Global Offensive community took place, where team iBuyPower purposefully lost a match against NetCodeGuides.com. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The team was later banned by Valve, though ESL unbanned the team from their tournaments in 2017. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "They are still unable to play in Majors.In October 2015, a number of professional eSports organization with Counter-Strike teams announced the formation of a trade union that set several demands for future tournament attendance. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The announcement was a publicly posted email written by Natus Vincere CEO Alexander Kokhanovsky that was sent to organizers of major esports events. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Among these demands was notice that teams part of the union would not attend a tournament with a prize pool of less than $75,000 for Counter-Strike: Global Offensive and $100,000 for Dota 2. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Among the teams that were announced were Natus Vincere, Team Liquid, Counter Logic Gaming, Cloud9, Virtus.pro, Team SoloMid, Fnatic, Ninjas in Pyjamas, Titan, and Team EnVyUs. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In 2016, the World eSports Association (WESA) was founded by ESL and many eSports teams, including Fnatic, Natus Vincere, Team EnVyUs, and FaZe Clan, though the latter-most left soon after its formation. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In the announcement statement, WESA said they would \"further professionalize eSports by introducing elements of player representation, standardized regulations, and revenue sharing for teams\". ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Alongside this, they also plan to help the fans and organizers by \"seeking to create predictable schedules\".",
    "keywords": [],
    "images": []
  },
  {
    "text": "Esports organizations Cloud9 and Dignitas, among others, announced plans in February 2020 to launch Flashpoint, a franchise-based league for Counter-Strike, as to counter concerns over the state of the current promotion/regulation leagues, with the league to be owned by the teams rather than a single organization, as in the case of the Overwatch League. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "As the game and the scene grew in popularity, companies, including WME/IMG and Turner Broadcasting, began to televise Global Offensive professional games, with the first being ELEAGUE Major 2017, held in the Fox Theatre and broadcast on US cable television network TBS in 2016. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "On August 22, 2018, Turner announced their further programming of Global Offensive with ELEAGUE’s Esports 101: CSGO and ELEAGUE CS:GO Premier 2018's docu-series on the TBS network. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Counter-Strike: Global Offensive received generally positive reception from critics, according to review aggregator Metacritic. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Since the game's release, Global Offensive has been steadily at the top of the Steam charts in terms of most concurrent players. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The game won the fan's choice \"eSports Game of the Year\" award at The Game Awards 2015.Reviewers praised Global Offensive's faithfulness to the previous game, Counter-Strike: Source, with Allistair Pinsof of Destructoid rating the game very highly and saying that Global Offensive is a \"polished and better looking\" version of the game. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "GameSpot writer Eric Neigher said in their review that this game stays true to its predecessors by adding much content, but tweaking small amounts and retaining their best features. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "The reviewers at gamesTM wrote in their review that the game stood \"as a glowing reminder that quality game design is rewarded in longevity and variety.\" ",
    "keywords": [],
    "images": []
  },
  {
    "text": "They also continued onto congratulate Valve that they had not only updated the popular game, but \"had completely outclassed its contemporaries.\" ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Martin Gaston of VideoGamer.com wrote that although he was too old to truly enjoy the game, he believed that it was a \"fine installment of one of the best games ever made,\" and that some people will experience \"what will become the definitive moments of their gaming lives.\" ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Xav de Matos for Engadget wrote that for the price, \"Global Offensive is a great extension to that legacy.\" ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Mitch Dyer from IGN said that \"Global Offensive is definitely a Counter-Strike sequel – it looks and feels familiar, with minor tweaks here and there to help balance old issues and surprise longtime players.\"Some of the features in the early releases of the game were criticized by reviewers. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "GameSpy's Mike Sharkey did not believe that the new content added was good or that there was much of it, and said that the Elo rating system seemed ineffective with many players of various skill levels all playing at once throughout the early days of release. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Evan Lahti from PC Gamer noted that the majority of new official maps in Global Offensive were only for Arms Race or Demolition game modes, while Classic maps were only given \"smart adjustments\" to minor details. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Pinsof thought that in its release state, it would not be the final version of the game. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Paul Goodman said that for long-time fans of the series, Global Offensive will start to show the game's age, expressing that he \"couldn't help but feel that I had been there and done that a dozen times before.\"Although reviewers liked the console versions of the game, they believed there were obvious differences between the PC and console versions. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Neigher believed that due playing with thumbsticks and shoulder buttons \"you definitely won't be getting the ultimate CS:GO experience.\" ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Ron Vorstermans for Gamer.nl said that the PC version is there to play at a higher competitive level, though he went on to say that the console versions are not inferior because of the PC's superiority for competition. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Dyer wrote that the PlayStation 3 version was at an advantage to the Xbox version because of the ability to connect a keyboard and mouse to the system. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "He continued on to say that the user-interface on both of the consoles was as good as the PC one. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Mark Langshaw of Digital Spy opined that although the game has support for the PlayStation Move, using it only makes the \"already unforgiving game all the more challenging.\"The game was nominated for \"Best Spectator Game\" in IGN's Best of 2017 Awards, for \"eSports Game of the Year\" at the 2017, 2018, and 2019 Golden Joystick Awards, for \"Best eSports Game\" at The Game Awards 2017 and The Game Awards 2019, and for \"Game, eSports\" at the 17th Annual National Academy of Video Game Trade Reviewers Awards. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "In 2018, the game was nominated for \"Fan Favorite eSports Game\" and \"Fan Favorite eSports League Format\" with the Majors at the Gamers' Choice Awards, and for \"eSports Title of the Year\" at the Australian Games Awards. ",
    "keywords": [],
    "images": []
  },
  {
    "text": "Official website Global Offensive at ValveSoftware.com Quotations related to Counter-Strike: Global Offensive at Wikiquote",
    "keywords": [],
    "images": []
  }
]